# syntax=docker/dockerfile:1
# обычнй образ, большой размер, весь go вложен в образ
# Указываем базовый образ среды выполнения
FROM golang:1.23
# создаем директорию внутри образа, которую будем собирать. Также укажем докеру, что это основная директория для всех последующих команд(относительный путь)
WORKDIR /app
# скопируем файл go.mod go.sum в рабочую директорию образа
COPY go.mod ./
# запустим загрузку модуля в рабочую директорию образа после выполнения получим набор инструментов Go версии 1.23 и все зависимости, установленные внутри образа
RUN go mod download
# теперь копируем исходный код копируем все в рабочую директорию
COPY . ./
# скомпилируем приложение с именем docker-gs-server, которое будет расположено в корневом каталоге образа
RUN CGO_ENABLED=0 GOOS=linux go build -o /docker-gs-server
# дадим возможность образу открывать порт 
EXPOSE 8080
# теперь скажем докеру какую команду запустить когда образ будет запущен в контейнере
CMD [ "/docker-gs-server" ]

